

* 1

** J
#+begin_src j
i=.fread 'input/1'
 l1=.  > 0 {"1 '   ' splitstring "1 > LF splitstring i
 l2=.  > 1 {"1 '   ' splitstring "1 > LF splitstring i

 0 { l1
 0 { l2
 0 1 2 3 {l1
 0 {"1 /:~"1 '   ' splitstring "1 > LF splitstring i	
#+end_src

#+RESULTS:
#+begin_example
46669

36559

46669
54117
25659
18867

┌─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬───...
│36559│54117│15179│18867│78485│28985│34206│58682│24655│52935│53728│71005│50792│13407│61779│16895│23324│28081│49063│61487│11872│16072│59610│71514│15786│17973│50570│22045│57193│14748│10514│29334│45642│39483│24655│22449│69515│74800│48811│45071│82630│76933│131...
└─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴───...
#+end_example


** Clojure

#+begin_src clojure
(let [raw (slurp "input/1")
      parsed (map #(clojure.string/split % #"   ") (clojure.string/split raw #"\n"))
      p-int  #(Integer/parseInt %)
      list-1 (sort (map (comp p-int first) parsed))
      list-2 (sort (map (comp p-int second) parsed))
      p-2-count (fn [n]
                  (* n (count (filter #{n} list-1))))]
  (prn {:part-1 (apply +
                       (map (comp abs -) list-1 list-2))
        :part-2 (apply + (map p-2-count list-2))}))
#+end_src

#+RESULTS:
: 46669   36559\n54117   62675\n25659   15179\n18867   82784\n94354   78485\n28985   76228\n42358   34206\n59950   58682\n97799   24655\n52935   64167\n59303   53728\n85106   71005\n50792   91433\n13407   14222\n67886   61779\n16895   63137\n30061   23324\n52760   28081\n58542   49063\n90229   61487\n13000   11872\n75051   16072\n95703   59610\n71514   95236\n38533   15786\n96889   17973\n50570   62950\n22045   76693\n57193   91433\n14748   85022\n10514   38767\n29334   47840\n88964   45642\n48941   39483\n70592   24655\n93664   22449\n96355   69515\n81294   74800\n48811   85577\n45071   85562\n92092   82630\n84197   76933\n97582   13139\n87792   86408\n54977   27338\n99783   29891\n69620   61216\n13987   77826\n99852   96463\n91433   60831\n78088   46665\n72987   42777\n42868   69997\n68892   46927\n34108   66123\n43478   18458\n19787   42868\n94776   47041\n79484   42868\n51651   87993\n24205   29529\n44859   90283\n20200   73827\n87459   73406\n56046   83755\n91769   22449\n67206   27695\n12181   17936\n60868   83249\n38752   22334\n99845   94472\n41505   61216\n60128   24655\n29568   78485\n22811   63720\n58897   73583\n72379   79339\n37663   41578\n79732   61216\n73155   46563\n81753   43279\n51621   51888\n93416   86408\n47921   59610\n80800   23324\n96164   73406\n11851   98656\n23151   90283\n38856   89669\n68276   82552\n98955   32695\n54728   30695\n29338   75446\n62950   59047\n65523   19589\n37775   59752\n44035   55601\n88679   53778\n51799   86633\n88184   62950\n91162   78485\n93338   54646\n88930   17554\n86160   77826\n11460   56897\n25918   45594\n72148   91433\n92158   37114\n93731   49360\n87043   44224\n33307   76228\n28611   70786\n13314   61216\n65566   40058\n20245   63137\n37773   33408\n78163   30754\n63537   76662\n64165   11339\n80838   23324\n51282   29108\n25277   59610\n59407   75468\n67162   32283\n29618   22449\n38169   77435\n74644   65347\n15925   76228\n64235   87695\n14313   31523\n65574   70278\n94576   46927\n28941   76693\n56933   75648\n90283   20996\n15912   76693\n37371   11483\n42928   61216\n20043   15456\n79060   50351\n95841   86342\n90503   22449\n34098   55194\n59349   27339\n52463   49245\n44382   59610\n86377   39994\n77346   51349\n32396   82630\n89974   40626\n56849   67629\n62875   86860\n56067   34945\n92962   49059\n62901   46892\n25886   77783\n21697   96304\n38147   17270\n14550   90283\n13342   70663\n70611   68152\n20481   21488\n28904   58215\n26634   39518\n52203   30752\n66212   78485\n90182   98936\n20740   15786\n66065   65617\n61202   45164\n26862   99261\n58796   40132\n78079   70988\n81851   93597\n71297   91433\n92854   65509\n80295   27424\n63299   44867\n15813   58215\n16650   76933\n53617   23324\n26984   16067\n18903   22496\n45338   10448\n78888   63137\n45642   41937\n33541   24655\n48364   44977\n45753   86408\n38974   87966\n74367   95952\n30987   24768\n69198   61027\n79165   23324\n36565   49245\n93880   23324\n58577   22449\n88572   11153\n23891   35210\n57919   56916\n68618   29125\n69689   24742\n63792   67434\n42378   91433\n30886   85562\n68874   73316\n47080   76228\n17364   50012\n26523   95236\n91160   12505\n82072   63137\n85218   88792\n21179   45280\n83540   22449\n62790   75446\n99201   76966\n24655   91601\n15468   59236\n69939   40216\n26652   51063\n72139   22449\n38765   15786\n37220   73406\n46720   15786\n23324   12724\n28463   22865\n74495   12866\n81338   47719\n48576   67579\n57908   85562\n96483   75446\n12243   46927\n18922   30274\n96066   50932\n32506   57089\n63137   18017\n80079   34565\n78238   57507\n29990   85562\n63341   77826\n53097   89535\n77250   67346\n18752   22230\n84225   91433\n23056   22728\n72203   44957\n12182   95236\n54287   57853\n78417   76693\n79546   61111\n97938   90283\n28464   91433\n43864   61216\n25327   45949\n76917   18588\n88304   61216\n16599   91970\n90372   38723\n78721   47963\n61712   73406\n40506   20355\n80458   13289\n50334   49245\n10066   99664\n33077   90921\n27603   87695\n51307   62936\n18791   49524\n90086   98799\n61487   76228\n80381   77826\n30353   75446\n46686   63367\n67471   50064\n22404   67635\n73240   47665\n38824   85562\n52873   78957\n89294   79544\n55505   36605\n21363   73406\n54456   90283\n26147   51518\n51044   98236\n27948   22449\n28048   76228\n52852   87695\n33020   76933\n66414   51084\n29109   75446\n10430   72012\n53057   63137\n99531   27252\n77723   76933\n87307   24655\n81886   50012\n97967   90283\n24057   64661\n23205   63137\n18662   76693\n89627   25871\n70743   50012\n27182   88872\n75446   50012\n88535   38500\n83093   69995\n67214   88991\n79553   33819\n61690   50012\n76228   98865\n50955   95236\n93037   19499\n24196   49526\n59691   67094\n35278   90283\n61597   23324\n56941   37523\n20120   97355\n87535   87032\n41203   63891\n16392   87787\n72594   75446\n95236   76693\n59675   65584\n68845   90283\n78485   33285\n44280   62583\n98434   19636\n86408   22449\n49172   15344\n33704   41932\n57434   72228\n72242   16591\n55017   75193\n57538   97837\n66108   35681\n22194   32467\n74204   41085\n75528   56270\n55070   13932\n12362   69548\n80880   46460\n92437   86408\n62756   37768\n61713   33991\n65166   15786\n66265   57948\n59605   81427\n95292   61216\n53322   61216\n92343   77826\n57881   43673\n25694   79166\n50803   62933\n12557   76228\n30235   63137\n60145   59610\n69385   54371\n67591   95236\n75778   57891\n32402   72023\n85763   79371\n77826   58215\n54653   52717\n43427   73406\n87693   78923\n42560   99999\n56662   98907\n34358   15149\n72062   87084\n87457   25270\n79098   46927\n96786   63137\n12893   90634\n72153   22959\n79455   13986\n94850   28046\n73433   11290\n18596   58215\n82630   78485\n33604   14849\n15222   74035\n61085   23906\n36243   10054\n61417   39396\n97586   61216\n38303   13532\n46927   78485\n97158   28915\n47223   24655\n71928   16050\n48850   10274\n63968   59834\n74998   51096\n12237   16089\n15340   68204\n28588   86420\n27774   27427\n87417   76693\n68167   20436\n82772   87695\n16746   41792\n49969   76228\n68165   28891\n87687   73914\n31995   73403\n51948   57812\n92704   73961\n44851   23324\n81688   48766\n92752   24655\n87448   42868\n14258   13555\n97152   95236\n16893   58215\n49941   72107\n92908   95236\n30101   75629\n83485   19453\n70442   95236\n90285   24655\n55498   23539\n38791   77826\n51701   84708\n30330   59334\n59586   61909\n69360   16800\n96194   66338\n26813   94571\n16730   60469\n20452   61216\n88869   62950\n36471   85562\n48094   11994\n53210   58215\n25883   55787\n67454   16997\n28364   91433\n29596   18200\n39653   42554\n78247   98641\n68869   10213\n37243   61575\n78248   91234\n86264   24655\n42101   22449\n81992   77493\n65269   73406\n79512   88490\n23050   68216\n71745   32372\n12275   22311\n72704   57374\n40391   37266\n93996   81448\n60235   71232\n23986   45642\n31562   61893\n76700   68049\n95646   70208\n19567   23324\n91012   93539\n29318   15559\n25010   11836\n35563   51368\n54704   76228\n49819   40935\n33230   61216\n79086   14268\n51170   18475\n66485   81497\n18849   62950\n64392   24655\n95125   54268\n57789   27894\n59448   86408\n47257   86384\n15786   91433\n61948   42868\n86728   58933\n99498   59808\n52830   35210\n70990   70735\n67116   15019\n63821   73107\n27729   77826\n61964   32077\n36375   88334\n25299   59610\n86368   55921\n86423   71213\n73061   88241\n98588   25835\n13938   21656\n99826   95236\n37553   68730\n64667   62007\n93565   82405\n42768   29866\n42731   76693\n20204   30794\n71882   28231\n93933   73406\n32525   84373\n89842   64081\n31297   45009\n27264   75446\n93838   64694\n60747   78485\n13328   22449\n40592   95236\n91398   20009\n11574   90283\n96548   35894\n34268   49890\n86325   39672\n63884   15842\n30812   23567\n69993   24655\n22994   85977\n36141   24655\n17881   23324\n87053   12341\n85897   11252\n64282   31676\n83859   82810\n37811   70856\n30617   65639\n12124   82075\n25279   61216\n50876   76933\n93773   75446\n11066   73504\n75494   22449\n10852   22449\n75214   75446\n17183   55952\n40332   91433\n29117   20899\n30888   45919\n73512   32221\n78708   26250\n13367   76228\n92813   97383\n51110   47725\n25552   95236\n31096   38747\n83451   76754\n22497   49245\n42453   76693\n91372   53487\n91733   61487\n71459   79153\n45515   95236\n25529   81102\n21597   73394\n43122   82630\n63641   64171\n77303   61216\n37944   58215\n11386   77826\n77018   79070\n82992   96114\n51119   77798\n73221   23324\n18732   34798\n42279   46927\n89508   73730\n27791   80194\n28523   95308\n27555   12881\n29648   54618\n13577   98443\n56947   76693\n36475   87505\n38270   71142\n84688   28274\n19271   76693\n23825   22945\n95718   51459\n91764   51788\n27386   42182\n18677   55015\n67612   76693\n11810   44178\n87498   75376\n74359   45642\n35714   56252\n86955   70950\n28543   86408\n21253   57179\n81283   73406\n54208   83349\n87550   37110\n88194   76693\n68969   49473\n94869   80272\n18066   64411\n31310   15786\n57043   78434\n55440   89060\n88510   61216\n69221   64444\n45336   23324\n39240   51320\n86973   61853\n78101   71772\n24917   38491\n30454   84950\n95917   89580\n96914   78485\n77197   50552\n67382   31174\n73864   88832\n68112   77826\n34762   15786\n53167   36945\n58539   32505\n67660   41818\n89709   35248\n87156   49245\n98670   84396\n12340   44671\n51671   87514\n47948   18060\n69823   76228\n35233   73406\n52807   24655\n94057   26388\n63741   59610\n82004   66606\n93513   60231\n75084   35371\n10372   88851\n89866   46927\n24553   79589\n20556   15786\n46412   22449\n78846   24491\n98088   76693\n31170   92173\n94801   52961\n51058   13445\n70594   50037\n35346   50338\n78257   23324\n73406   21744\n68359   46927\n41213   55805\n45250   42131\n43279   18812\n69199   15786\n53725   76497\n69398   37768\n11742   73406\n65219   58877\n31780   38597\n46113   90283\n30112   76693\n37748   60472\n12596   58428\n22346   98357\n43346   53539\n89142   78485\n14544   38869\n31577   55185\n55937   87695\n41189   35667\n25078   73406\n59330   94542\n84733   16627\n82488   73406\n82948   58215\n16789   91433\n53671   27376\n70549   50516\n97581   54013\n91708   61216\n64783   37768\n89911   46097\n74663   76228\n70646   60061\n23944   31181\n30697   93934\n27561   95236\n52655   68084\n90627   38964\n27641   35708\n14184   91433\n42968   17857\n72204   30261\n77368   35970\n17048   89985\n20782   18407\n64749   78485\n41007   26752\n11880   97776\n44202   24368\n97301   23407\n61077   74465\n38804   77826\n13897   48877\n14508   37578\n61383   53091\n16885   29289\n37225   52081\n64685   35992\n31682   95236\n63631   10368\n45781   24466\n24092   65388\n31728   76228\n45777   22113\n51779   60657\n33859   29358\n53484   78827\n61319   49899\n36093   48789\n40584   77905\n56381   54295\n22662   38614\n24641   22449\n88324   59610\n78924   95236\n74820   61487\n77398   60846\n99595   63137\n65832   49245\n89471   11285\n90188   76593\n97763   71720\n98824   77826\n14418   20513\n39862   73406\n55906   78485\n86059   29127\n20742   97241\n88269   91433\n17962   86920\n32602   49245\n95412   59994\n83267   70431\n36825   24655\n89562   43279\n16860   72596\n53577   96790\n46665   76574\n71813   67270\n35210   15445\n33400   76693\n96069   65213\n46322   39179\n95285   91433\n95767   86269\n15236   76933\n27778   49357\n16170   30140\n57870   63137\n80794   63137\n84281   57089\n91022   26553\n55848   49245\n13825   49245\n91230   87028\n54860   73406\n66596   53306\n61216   64519\n50012   76693\n36465   83257\n87188   75446\n73588   21801\n94757   20402\n28170   60768\n24891   38174\n91787   76693\n63785   43279\n14566   90752\n55392   90283\n39790   67787\n40079   80845\n33827   34045\n79864   78485\n82775   43279\n67159   10612\n53001   37768\n52173   58727\n28322   76933\n84518   33044\n76693   27243\n49225   44682\n22449   75446\n80658   49373\n43255   22449\n59058   73490\n44951   49402\n71201   28356\n55944   42868\n33202   83266\n86699   66983\n88453   85814\n77034   58838\n85850   76228\n41409   88724\n36649   11112\n88428   93089\n59610   66639\n48137   90283\n86400   90487\n28104   46927\n43317   59610\n85510   67445\n99532   78485\n70359   15786\n42034   88131\n80957   68660\n43032   95236\n33582   40382\n58215   94486\n19221   36076\n91307   77826\n64821   76693\n89517   63137\n53579   18009\n82987   91433\n94727   51659\n19906   91433\n80106   43532\n28240   71843\n29670   23324\n39700   87695\n47283   78485\n39801   76933\n25980   96028\n21945   71497\n78407   78485\n85640   45318\n51978   50012\n11601   76575\n83651   31125\n95958   95956\n77749   23336\n13537   84975\n88065   52971\n38210   98657\n40101   36035\n32397   75288\n96618   16256\n42989   19324\n72932   43609\n18771   34539\n58557   86408\n92319   79573\n38295   94964\n10485   63913\n31358   76228\n38846   75446\n72221   22449\n66323   76933\n57089   60456\n88674   50047\n75813   15508\n22055   60704\n69047   96120\n73862   15909\n83222   67849\n76393   80920\n76522   69689\n71666   76228\n63583   12283\n19328   28164\n39355   77826\n85096   76933\n42056   31488\n92747   13579\n84937   47182\n17024   82132\n56871   90283\n97790   46927\n22993   68190\n68482   55096\n79976   85107\n90940   52882\n65919   63137\n62007   49245\n13415   59610\n26893   24655\n44653   95236\n33612   99036\n46478   42868\n70970   80135\n60481   95236\n15301   59360\n17212   37414\n80899   75446\n67495   21742\n18319   14479\n34445   58215\n39486   42282\n36028   44519\n92208   46483\n88362   90245\n53764   48959\n85604   74027\n96035   95893\n29561   30742\n74152   61216\n49507   46274\n87695   76693\n18100   15786\n21313   73406\n62234   12938\n25025   49466\n60890   74332\n11565   33629\n84299   76228\n34861   90283\n21353   73528\n99978   66897\n46529   22449\n13104   25219\n68752   88910\n26478   76933\n87668   43279\n49777   25060\n86763   75446\n73023   45052\n72004   51554\n88141   23926\n33130   82630\n82472   22449\n64754   80502\n57842   62007\n93088   72374\n45727   93735\n53996   19768\n49245   46046\n85299   19540\n56446   63137\n92445   82605\n67790   75139\n16758   26579\n66664   89655\n32710   80610\n75707   49245\n65814   95623\n58220   87669\n16612   76228\n24698   16590\n23184   73406\n91238   15786\n11843   91433\n86625   85562\n41307   77826\n26670   69594\n64855   63137\n63544   83733\n56574   24108\n79163   67158\n99311   95420\n17640   85562\n66865   91397\n31429   37768\n85562   49245\n93263   76716\n81248   45189\n91852   47062\n58324   52943\n63446   36264\n96407   87488\n46436   57089\n12385   26581\n91195   25257\n88835   32326\n21315   77826\n24216   97211\n37075   50012\n46375   49245\n68824   88237\n24882   44857\n60941   75157\n61864   64400\n41858   97465\n83877   61487\n26722   85343\n52455   55804\n22568   74046\n93290   83623\n76933   73008\n61124   76228\n32025   67436\n26293   77826\n46658   78485\n12043   52527\n47464   24655\n56275   41945\n57840   33284\n60040   82705\n10256   95591\n49049   90283\n37768   43279

* 2

** J
#+begin_src j
i=.fread 'input/2'
LF splitstring i

2 3 4 = 1 2 3
   1 23 435 _1 = /:~   1 23 435 _1

   (2&* ` (20&*) @. 1&=) 20

#+end_src

#+RESULTS:
#+begin_example
┌──────────────┬────────────────────┬───────────────────────┬────────────────────┬───────────────────────┬──────────────┬─────────────────┬───────────────────────┬──────────────┬─────────────────┬───────────────────────┬────────────────────┬───────────────...
│44 47 48 49 48│64 66 68 69 71 72 72│21 22 25 26 28 30 31 35│41 43 44 46 47 50 57│32 35 36 35 38 40 43 44│95 97 99 97 94│63 66 65 67 69 69│42 44 41 43 45 47 48 52│69 71 72 71 76│77 78 78 80 82 84│27 29 31 34 35 36 36 33│16 17 17 18 21 22 22│88 89 91 91 92 ...
└──────────────┴────────────────────┴───────────────────────┴────────────────────┴───────────────────────┴──────────────┴─────────────────┴───────────────────────┴──────────────┴─────────────────┴───────────────────────┴────────────────────┴───────────────...

0 0 0

0 0 0 0

20

1 2 3
#+end_example

** Clojure

#+begin_src clojure

(let [raw (slurp "input/2")
      p1 (clojure.string/split raw #"\n")
      p2 (map #(clojure.string/split % #" ") p1)
      parsed (map #(mapv (fn [i] (Integer/parseInt i)) %) p2)
      asc-or-desc? (fn [li] (or (apply < li) (apply > li)))
      safe-diff?   (fn [[f s]]
                     (let [diff (abs (- f s))]
                       (and (> diff 0) (< diff 4))))
      safe? (fn [li]
                (or (and (asc-or-desc? li) (every? true? (map safe-diff? (partition 2 1 li))))))
      damp-safe? (fn [l]
                   (or (safe? l)
                       (some true? (map safe? (map-indexed (fn [idx vl]
                                                               (concat (subvec l 0 idx)
                                                                       (subvec l (inc idx) (count l)))) l)))))]
  {:part-1 (count (filter true? (map safe? parsed)))
   :part-2 (count (filter true? (map damp-safe? parsed)))})
#+end_src

* 3

** Clojure


#+begin_src clojure
(let [raw     (slurp "input/3")
      parse   (fn [[mul nums]]
                (map #(Integer/parseInt %) (clojure.string/split nums #",")))
      reg   #(re-seq #"mul\((\d{1,3},\d{1,3})\)" %)
      parsed  (map parse (reg raw))

      ;; Every do() here should be executed
      parsed-2  (clojure.string/split raw #"do\(\)")
      ;; now we get everything that has a don't
      parsed-3 (map #(clojure.string/split % #"don't\(\)") parsed-2)
      ;; and clean up, since we already filtered the "do()s"
      parsed-4 (map first parsed-3)
      parsed-5 (map parse (reg (clojure.string/join parsed-4)))]
  (prn {:p1  (apply + (map #(apply * %) parsed))
        :p2  (apply + (map #(apply * %) parsed-5))}))

#+end_src

* 4

** J


*** 

- *fread 'input/4'* reads the input
- *LF splitstring str* splits the string and gives out boxed strings
  of the line ending
- *>* monad unboxes
- *'' splitstring"1* splits the string in every characters, but
  applied on the rank 1 of the noun, so, instead of counting each of
  the lines, it counts each thing inside of the line.

  This gives us all of the characters cutted out.


#+begin_src j
0 { <"1 'X' E."0  (> '' splitstring"1 > (LF splitstring fread 'input/4'))
0 { <"1 'M' E."0  (> '' splitstring"1 > (LF splitstring fread 'input/4'))
0 { <"1 'A' E."0  (> '' splitstring"1 > (LF splitstring fread 'input/4'))
0 { <"1 'S' E."0  (> '' splitstring"1 > (LF splitstring fread 'input/4'))  
#+end_src

#+RESULTS:
#+begin_example
┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─...
│0│0│0│0│1│0│0│0│0│1│0│0│0│0│0│0│1│0│1│1│0│0│0│0│0│1│0│1│0│0│1│0│1│0│0│0│0│1│0│0│1│0│1│1│0│0│0│0│0│1│0│0│0│1│0│0│1│0│0│1│0│0│0│0│0│0│0│0│0│0│0│0│0│0│0│0│0│0│1│0│0│1│1│0│0│0│0│0│1│0│0│1│0│1│0│0│0│1│0│1│0│0│1│0│0│0│0│0│1│0│0│0│1│0│1│0│0│0│0│0│0│0│0│0│1│0│0│1...
└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─...

┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─...
│1│0│1│1│0│1│1│0│1│0│1│0│1│0│0│1│0│1│0│0│1│1│0│0│0│0│0│0│0│1│0│0│0│1│0│0│1│0│0│0│0│0│0│0│1│0│0│1│0│0│0│0│1│0│0│1│0│1│1│0│1│1│0│1│1│0│0│0│1│0│0│0│0│0│1│1│0│0│0│1│0│0│0│1│0│0│0│1│0│1│0│0│0│0│0│0│1│0│0│0│0│1│0│0│0│1│1│1│0│1│0│1│0│0│0│1│0│1│0│0│1│0│0│1│0│1│0│0...
└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─...

┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─...
│0│0│0│0│0│0│0│1│0│0│0│1│0│0│1│0│0│0│0│0│0│0│1│0│1│0│1│0│1│0│0│0│0│0│1│0│0│0│1│0│0│1│0│0│0│1│0│0│0│0│0│1│0│0│0│0│0│0│0│0│0│0│0│0│0│0│0│0│0│0│0│0│0│0│0│0│1│0│0│0│1│0│0│0│1│0│1│0│0│0│0│0│1│0│0│1│0│0│0│0│1│0│0│0│1│0│0│0│0│0│0│0│0│0│0│0│1│0│1│0│0│0│1│0│0│0│0│0...
└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─...

┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─...
│0│1│0│0│0│0│0│0│0│0│0│0│0│1│0│0│0│0│0│0│0│0│0│1│0│0│0│0│0│0│0│1│0│0│0│1│0│0│0│1│0│0│0│0│0│0│1│0│1│0│1│0│0│0│1│0│0│0│0│0│0│0│1│0│0│1│1│1│0│1│1│1│1│1│0│0│0│1│0│0│0│0│0│0│0│1│0│0│0│0│1│0│0│0│1│0│0│0│1│0│0│0│0│1│0│0│0│0│0│0│1│0│0│1│0│0│0│0│0│1│0│1│0│0│0│0│1│0...
└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─...
#+end_example


*** Copying code_report

I'm trying to do the solution in J by seeing what Connor does on code report.

First, I need a way to find out how many 'XMAS' strings exist in an array. Here's how:

#+begin_src j
+/'XMAS'&E.
#+end_src

Now, let's cut this a bit:

- *'XMAS'&E.*

  We're creating a monad from a dyad, by using *bond* (&) to set
  'XMAS' as the left argument for the *member of interval* (E.) verb.
  In other words, this new verb will search for 'XMAS' in any string
  we give it.

- *+/'XMAS'&E.*

  *Member of interval* gives us ones (1) for the start of the pattern
  we give it and zeroes for all of the other characters. Then, with
  that, we can sum all of the zeroes.

Next, I have to spin the matrix in 8 directions.
#+begin_src j

load 'math/misc/matutil'

 +/ 'XMAS' E.

NB. count xmas
+/'XMAS'&E.

n=. > 'XMAS';'XMAS';'XMAS';'XMAS'

NB. apply all transformations


NB. 0. regular
n
NB. 1. 90o
|:n
NB. 2. 180o
|."1 n
NB. 3. 270o
|:|."1 n
NB. 4. 45o
>/.n

NB. train
NB. Applying diagonals to each rotation also
(], |:, |."1, |:@:(|."1), >/., >/.@:|:, >/.@:(|."1), >/.@:|:@:(|."1))n

in=.> LF splitstring fread 'input/4_alt'
p1=. +/@:(+/@:('XMAS' E."1  (], |:, |."1, |:@:(|."1), >/., >/.@:|:, >/.@:(|."1), >/.@:(|:@:(|."1)))))
p1 in


test=.+/@: (+/@:('XMAS' E."1  (], |:, |."1, |:@:(|."1), >/., >/.@:|:, >/.@:(|."1), >/.@:|:@:(|."1))))

test ex
(], |., |."1, |:@:(|."1), >/., >/.@:|:, >/.@:(|."1), >/.@:|:@:(|."1))ex2

]ex2
|:ex2
|."1 ex2
|:@:(|."1)ex2
>/.ex2
>/.@:|:ex2
>/.@:(|."1)ex2
NB. correct above
>/.@:(|."1@:|:)ex2 NB. This is wrong. I need to do this from left lower position towards right upper position
NB. It might be right because I'm getting even lower results now...

ex=. > 'MMMSXXMASM';'MSAMXMSMSA';'AMXSXMAAMM';'MSAMASMSMX';'XMASAMXAMM';'XXAMMXXAMA';'SMSMSASXSS';'SAXAMASAAA';'MAMMMXMMMM';'MXMXAXMASX'

ex2=.>'..X...';'.SAMX.';'.A..A.';'XMAS.S';'.X....'

ex3=. > 'XMASAMX'; 'MMXXXMM'; 'AXAXAXA'; 'SXXSXXS'; 'AXAXAXA'; 'MMXXXMM' ; 'XMASAMX'
ex4=. > 'AB';'CD'

(], |., |:"1, |:@:(|."1), >/., >/.@:|:, >/.@:(|."1), >/.@:|:@:(|."1))ex2


]ex2
|:ex2
|."1 ex2
NB. '' splitstring"1 > LF splitstring fread 'input/4'


#+end_src

#+RESULTS:
#+begin_example
...
│M│X│S│M│M│X│S│X│S│X│X│X│M│A│X│A│A│A│X│X│A│A│S│A│M│A│X│X│A│M│X│M│M│A│M│M│M│X│M│X│A│M│X│M│X│X│M│S│X│M│A│A│X│S│M│M│M│S│A│M│X│X│A│A│A│X│S│A│S│A│M│S│A│S│M│S│M│M│M│S│S│X│S│S│M│M│M│A│A│S│M│S│M│S│X│M│X│M│A│M│X│A│A│A│X│X│M│A│X│S│A│M│A│M│X│A│X│S│X│M│A│M│A│X│A│A│A│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│A│X│S│S│M│S│A│M│X│S│X│M│A│M│M│S│A│M│X│M│M│M│A│M│A│S│M│M│S│S│X│X│X│M│A│S│A│S│M│S│S│S│S│M│M│X│X│A│S│M│A│A│A│A│A│A│S│A│X│X│S│M│X│S│M│M│A│X│A│M│M│A│S│A│A│X│A│A│M│M│X│A│X│M│X│M│M│M│S│A│M│X│M│A│S│X│M│M│S│S│X│M│S│S│X│S│X│M│M│A│M│A│M│S│X│M│S│A│S│X│S│M│S│S│S│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│S│M│A│S│A│M│X│M│A│S│A│M│X│M│X│M│M│M│S│A│S│M│S│M│A│M│A│A│X│M│A│S│X│S│X│S│A│X│A│A│A│X│A│A│S│M│S│A│M│X│M│S│S│S│M│X│S│M│M│M│X│M│A│X│A│M│M│M│S│X│M│A│M│X│M│S│M│S│A│M│A│M│M│S│A│X│X│M│M│X│M│A│M│X│M│S│S│X│A│M│X│M│A│M│X│S│A│A│S│M│M│S│X│M│X│A│S│A│M│A│A│A│X│A│X│A│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│A│X│M│A│M│S│M│A│M│A│S│A│M│S│M│X│A│A│A│M│A│M│A│X│X│M│A│M│X│M│A│S│M│M│A│X│M│X│M│M│M│S│S│X│M│M│X│A│A│X│X│X│A│X│A│X│A│M│A│S│A│A│M│A│S│A│M│A│A│X│A│M│X│S│A│M│X│M│M│A│M│M│M│A│S│X│S│M│S│M│M│S│X│S│A│M│A│M│M│M│S│X│M│A│M│A│X│X│M│M│X│S│X│A│M│M│A│M│A│M│S│M│M│S│M│S│M│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│X│M│A│M│X│S│A│M│X│S│A│M│X│S│S│M│M│S│M│S│M│M│M│A│M│X│X│A│A│X│M│S│S│S│M│S│A│X│M│A│M│M│X│S│S│X│S│M│M│M│M│M│S│S│M│X│S│A│M│X│X│M│A│M│A│S│M│S│M│M│M│X│S│A│X│A│M│X│M│S│A│M│M│S│X│X│A│A│A│A│A│M│S│A│M│A│X│X│A│A│X│S│A│M│M│S│S│M│S│M│S│S│M│X│S│X│M│A│M│A│X│X│A│A│S│A│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│A│S│X│M│A│X│M│M│S│M│M│M│S│A│M│M│X│M│X│X│X│A│X│S│X│M│A│S│A│X│S│X│M│X│A│A│X│X│S│X│A│A│X│M│A│M│A│X│M│X│X│A│A│X│X│A│X│M│A│S│X│X│X│M│A│A│A│M│M│A│A│X│X│M│A│S│A│M│M│X│S│A│S│M│M│A│M│S│S│S│M│S│X│M│X│S│S│M│M│M│S│M│S│A│S│A│M│A│A│A│A│X│A│M│A│M│M│X│A│S│M│S│S│M│S│M│A│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│A│M│A│M│M│M│A│A│M│A│A│A│X│A│X│X│M│A│S│M│X│M│M│M│X│X│X│S│X│S│M│A│M│A│M│A│M│X│M│M│S│S│M│X│M│M│S│M│M│X│S│S│S│M│M│M│M│M│A│M│X│M│S│M│M│X│S│A│S│M│M│S│S│M│M│A│A│X│S│A│S│X│M│A│S│X│M│X│A│X│A│X│M│M│A│X│M│A│S│X│M│A│M│X│M│A│S│M│M│M│S│S│M│M│A│S│A│S│X│S│A│A│M│X│X│M│X│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│S│M│M│A│S│M│M│S│S│M│X│S│A│M│M│M│M│A│A│A│S│A│M│S│A│M│X│M│A│X│A│M│A│X│A│S│A│A│A│M│X│A│A│X│A│M│A│X│A│X│X│M│A│M│S│A│X│A│S│A│M│X│A│S│A│M│X│A│A│A│X│A│A│X│M│M│A│M│A│S│M│S│A│M│A│X│M│X│M│M│M│M│M│M│S│S│M│M│A│M│X│S│X│S│M│M│A│S│X│A│A│X│X│S│M│M│X│X│M│M│M│M│M│M│A│M│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│A│X│S│A│M│A│A│A│A│A│M│A│M│X│A│A│X│M│S│M│S│A│M│M│M│S│M│M│M│M│X│X│S│X│M│X│M│M│X│S│S│S│X│S│X│X│X│M│M│S│S│M│S│M│S│A│S│A│S│A│S│X│M│M│A│S│M│S│S│S│S│S│M│X│X│X│M│M│A│M│M│M│M│S│M│M│X│A│A│A│A│X│A│A│M│A│A│S│X│M│X│A│M│X│M│M│A│M│M│S│S│M│M│X│M│S│M│X│M│A│M│S│A│M│X│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│A│X│M│A│M│S│M│S│S│M│X│A│S│X│S│M│S│X│M│X│S│A│M│X│A│A│A│A│X│M│S│M│M│A│S│X│S│M│A│X│M│A│M│S│M│M│M│S│X│A│M│A│M│X│M│A│X│A│M│X│M│X│X│M│X│M│A│A│A│A│A│X│X│S│A│S│X│M│M│X│X│A│A│A│A│A│X│S│S│M│S│S│M│S│S│S│M│M│M│S│M│M│M│A│X│M│A│M│X│A│M│M│A│X│A│A│A│X│A│A│X│M│M│M│A│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│M│M│S│A│M│X│A│M│X│M│M│X│M│A│X│X│M│X│M│A│S│X│M│M│S│S│M│M│A│X│S│A│S│A│M│M│A│M│X│S│A│S│X│X│A│A│A│A│X│M│X│X│X│M│A│S│M│X│M│S│A│M│X│M│M│M│M│S│M│M│S│M│M│S│A│M│X│S│A│X│S│M│S│S│M│S│M│X│A│M│M│X│A│M│X│X│A│A│X│A│A│X│S│M│S│S│S│S│M│A│S│X│S│M│S│M│S│S│M│S│S│S│M│S│M│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│M│X│M│A│X│X│A│M│S│X│S│M│M│A│M│A│M│A│M│M│M│X│S│A│A│X│M│S│M│M│M│A│M│A│M│S│M│M│X│S│A│X│X│S│S│M│M│X│S│X│M│S│S│X│A│X│M│A│S│A│M│S│M│S│M│S│A│A│X│X│A│X│A│M│A│M│M│M│A│A│S│A│A│A│X│M│M│S│A│A│A│M│X│M│A│M│M│M│X│S│M│M│S│A│M│X│X│A│X│S│M│A│X│A│A│A│X│A│A│A│A│M│A│A│A│A│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│M│M│S│M│M│S│M│M│X│M│A│X│M│A│S│A│X│M│M│M│S│A│M│M│S│X│M│A│A│A│M│A│M│A│M│A│S│X│X│M│A│X│A│X│X│X│S│M│S│A│A│X│A│S│M│M│A│M│X│A│X│A│A│A│A│A│X│M│M│M│M│M│M│S│A│M│X│M│M│M│M│A│S│A│M│X│A│S│X│M│A│S│A│M│S│S│S│S│X│X│A│X│M│A│M│S│M│M│M│A│M│X│M│S│A│S│M│M│M│M│S│M│S│S│S│M│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│A│A│A│A│X│M│A│M│A│S│M│X│S│A│M│X│S│X│X│S│M│M│X│A│A│A│S│X│S│M│S│X│S│M│S│A│S│M│X│M│X│M│M│M│S│M│A│A│S│A│M│X│M│A│S│A│M│M│S│S│M│M│S│M│S│M│A│X│A│A│X│A│A│M│X│X│A│X│A│A│M│A│M│X│X│M│A│S│X│M│X│M│A│M│X│A│A│S│A│X│S│M│S│X│M│M│A│S│M│X│M│A│M│M│A│M│X│X│A│A│X│X│M│X│A│X│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│M│S│S│M│M│S│A│M│A│X│X│M│M│X│X│M│A│X│X│M│A│S│M│M│S│M│S│A│A│X│M│A│S│A│M│X│S│M│X│S│M│M│M│A│A│A│M│A│M│M│M│S│X│M│M│S│A│A│A│A│A│X│M│A│M│X│A│S│M│X│S│M│A│S│X│S│S│M│S│S│S│S│M│X│S│A│X│S│A│S│M│S│S│M│M│M│M│M│S│M│A│M│M│A│M│X│A│M│A│X│M│X│M│X│M│S│S│S│M│M│S│A│S│M│M│M│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│M│A│X│A│M│X│A│M│X│M│S│X│A│A│S│X│M│M│M│S│A│M│M│M│A│X│M│M│M│M│M│M│M│A│M│M│X│M│A│M│A│A│M│S│M│S│X│S│M│S│A│S│M│S│A│X│M│M│S│S│M│X│M│A│S│A│M│X│M│M│X│M│A│X│A│A│A│M│A│A│M│X│M│A│S│X│M│X│A│M│A│A│X│X│X│X│A│A│X│S│M│M│S│A│A│M│S│S│S│M│S│M│S│A│X│X│A│X│X│A│X│M│A│A│A│X│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│S│A│M│X│S│X│M│M│S│X│M│M│M│M│X│A│X│A│M│M│M│M│S│S│S│S│X│M│M│X│X│X│S│M│M│A│S│M│S│S│S│M│M│M│A│M│X│M│A│M│A│S│X│M│A│X│S│A│M│A│X│S│S│M│M│A│S│A│S│M│X│M│A│S│M│M│M│A│M│M│M│S│M│M│S│A│M│M│S│M│M│M│M│S│A│S│M│X│A│M│X│A│M│M│X│X│A│A│X│A│M│A│S│M│S│M│M│M│X│M│X│X│S│S│M│S│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│M│A│S│M│A│A│S│A│M│A│S│A│M│M│X│M│M│X│S│A│X│S│A│A│A│M│A│M│S│X│M│A│S│A│M│S│X│A│A│M│M│X│A│M│A│M│A│M│X│M│M│X│X│M│A│M│M│A│S│A│M│M│A│M│X│X│M│A│S│A│A│A│A│X│X│X│M│M│M│X│M│X│A│M│S│A│M│A│A│A│A│M│X│M│X│M│A│S│M│S│M│S│X│S│M│M│M│S│M│S│M│A│M│X│A│A│A│A│A│M│S│M│X│M│X│X│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│S│A│M│M│S│M│M│A│S│A│S│M│S│A│A│X│A│M│S│A│S│A│M│M│M│M│X│M│A│A│M│A│M│M│M│X│M│M│M│S│X│M│X│M│A│S│A│M│X│A│S│X│M│M│S│M│S│A│M│A│M│S│A│M│M│X│M│X│M│M│M│M│S│S│M│M│X│X│X│S│S│S│M│M│S│M│M│S│S│S│M│S│A│M│X│M│M│A│M│X│A│M│A│X│X│M│A│X│A│X│M│A│M│X│X│M│M│X│A│X│M│M│M│S│M│M│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│S│M│S│X│M│X│X│M│M│M│M│A│M│M│S│M│A│X│M│M│M│A│X│S│A│M│A│S│X│S│M│M│S│A│A│X│A│X│M│X│X│X│M│S│A│S│A│S│X│X│M│A│A│A│A│X│M│A│S│A│M│S│A│S│A│S│X│X│M│A│M│A│M│A│A│A│X│M│A│X│X│A│X│A│M│A│A│A│A│M│X│M│A│S│A│X│X│M│S│X│S│M│X│M│M│X│M│X│A│A│M│A│S│X│S│M│S│S│X│M│A│A│A│A│X│M│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│A│X│A│X│M│S│A│X│S│A│X│M│A│M│A│X│X│X│M│M│A│S│X│M│S│A│S│A│S│M│X│A│X│X│M│S│S│S│M│M│M│M│X│M│A│M│X│A│A│X│X│S│S│M│M│S│S│M│M│M│A│M│X│M│M│X│A│M│X│M│A│M│A│M│X│M│M│X│S│M│M│S│A│M│M│S│M│M│S│S│M│A│S│X│S│M│S│M│M│S│A│M│M│X│A│M│A│M│M│M│S│M│A│S│X│A│A│A│A│A│S│X│M│S│M│S│S│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│M│S│M│A│M│A│M│S│A│M│S│A│M│X│S│A│M│S│S│M│S│A│M│S│M│M│X│S│M│S│S│M│X│S│A│M│X│A│A│A│X│M│A│S│X│M│A│M│A│M│A│M│X│X│M│M│A│S│M│M│S│M│A│M│M│M│A│A│M│A│M│X│S│M│X│M│A│X│A│X│X│A│M│A│A│A│X│M│X│X│X│S│A│M│A│A│M│A│M│A│M│A│S│M│M│A│S│A│S│A│M│M│S│X│M│M│M│S│M│M│A│A│X│X│A│A│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│A│M│M│S│M│S│M│M│A│M│S│A│M│A│M│M│M│X│A│X│M│A│M│X│M│X│A│M│X│A│M│M│M│M│A│S│X│S│S│S│S│S│X│X│M│A│S│M│S│M│S│A│M│X│X│S│A│M│A│A│M│X│A│M│S│X│S│S│S│M│S│A│A│A│A│M│M│S│M│M│S│X│M│A│S│X│M│M│A│M│X│M│A│M│S│M│X│A│X│A│M│X│M│X│S│A│S│X│S│M│S│X│M│A│M│X│M│A│M│S│M│M│M│M│S│S│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│X│M│M│M│M│A│A│M│S│M│S│X│M│X│S│S│S│S│S│M│S│S│M│M│S│S│M│M│M│M│S│S│X│X│M│X│X│M│A│M│A│M│M│M│S│M│X│A│A│A│A│M│A│M│M│M│A│S│M│M│X│S│X│S│A│A│M│A│A│A│M│A│M│S│X│S│A│A│A│A│X│X│M│M│M│M│M│M│A│S│A│M│A│M│A│M│S│M│S│X│M│A│X│X│M│M│S│M│S│X│S│M│S│A│M│X│S│A│M│S│A│S│X│A│M│X│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│X│X│M│A│X│M│S│M│X│A│M│X│M│M│M│M│A│A│A│M│X│A│A│A│A│A│A│S│A│M│A│X│M│M│M│S│M│M│M│M│A│S│A│A│A│A│M│S│M│S│M│S│A│A│M│X│A│M│X│A│A│S│X│S│M│S│M│M│M│M│M│M│X│A│A│M│M│S│S│S│M│S│X│A│A│A│X│S│M│X│M│S│M│M│A│X│A│A│A│M│M│S│X│S│A│A│S│X│M│A│X│A│M│M│S│A│S│X│M│S│A│M│X│X│M│A│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│S│A│S│M│S│M│M│A│M│X│M│X│M│A│A│M│M│X│M│A│M│S│M│M│S│S│M│M│A│M│A│X│X│M│A│A│A│A│X│S│A│S│X│S│M│S│M│A│M│M│A│S│M│S│S│S│S│S│M│M│X│M│A│S│A│A│A│X│X│X│M│X│M│M│M│M│M│X│A│A│A│S│X│M│S│M│M│S│A│M│X│A│M│S│S│S│M│S│M│S│A│A│X│M│A│M│S│A│M│M│M│S│X│M│X│M│X│M│M│M│S│M│A│M│X│X│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│X│A│X│A│A│A│X│X│A│A│M│A│X│M│M│X│X│S│A│S│M│X│A│X│X│A│A│X│M│M│M│X│M│M│S│S│S│M│X│M│X│S│A│M│A│M│M│S│S│M│A│M│M│A│A│X│X│X│X│X│A│M│X│M│S│M│S│A│M│X│X│A│M│X│S│A│S│M│S│M│M│M│M│M│A│M│M│M│A│M│M│A│M│A│X│A│A│M│X│M│M│S│S│M│M│M│S│X│M│A│A│A│A│M│S│A│M│X│A│A│X│M│S│S│X│A│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│M│M│M│S│M│X│M│M│M│X│S│A│M│X│S│S│X│A│A│M│A│S│M│M│S│S│M│M│S│A│X│A│M│X│A│A│A│X│S│X│S│M│M│M│A│M│A│X│X│M│S│M│M│M│S│M│M│A│S│X│M│M│S│A│A│X│X│A│S│M│S│S│X│M│S│A│X│A│M│X│A│A│A│M│A│S│A│M│M│M│X│X│M│A│X│M│M│M│M│X│M│A│A│A│A│A│X│X│A│M│M│S│S│M│A│A│M│S│M│M│S│A│A│S│X│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│A│S│A│A│M│S│M│S│A│M│M│M│X│S│A│A│A│M│X│M│A│M│A│A│A│M│A│A│S│A│S│M│M│S│X│S│M│M│A│M│M│A│S│M│X│M│A│X│S│A│X│X│A│A│A│A│X│A│A│A│A│X│M│M│M│X│X│M│S│A│A│A│A│X│M│S│M│S│M│S│S│S│S│S│X│S│X│X│M│A│M│X│M│X│M│S│A│X│M│A│M│X│S│M│M│S│S│S│X│S│X│A│A│M│S│M│M│X│M│A│M│M│M│M│X│M│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│A│M│M│M│X│A│A│M│A│M│A│A│S│M│M│M│X│M│M│M│X│M│M│M│M│S│S│M│M│M│M│M│A│S│A│M│X│X│M│A│M│A│M│X│S│X│M│X│M│A│S│X│S│X│S│S│M│M│S│A│M│S│M│S│X│S│A│A│M│M│M│S│M│M│A│A│S│X│M│A│M│A│A│M│A│M│A│S│X│M│A│S│M│A│A│S│A│M│S│A│S│X│M│A│X│A│A│X│A│X│M│M│X│M│A│S│X│X│M│A│X│X│A│M│A│M│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│A│M│X│S│M│M│S│M│M│M│X│X│M│A│A│X│A│M│X│M│A│M│M│S│M│A│A│S│A│S│A│M│M│M│A│M│A│M│X│S│M│A│M│A│M│A│S│X│M│A│M│A│X│A│X│X│X│M│X│M│A│S│A│A│A│S│M│M│M│X│X│X│A│X│S│M│S│X│M│A│S│M│M│M│S│M│A│M│X│S│A│S│M│X│X│M│A│M│S│A│M│M│M│S│M│M│S│S│M│S│A│S│A│S│X│M│M│M│M│M│X│X│M│S│A│S│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│A│M│A│M│A│M│A│M│X│S│X│M│S│S│M│X│X│X│A│M│X│S│A│A│M│S│M│S│S│S│M│S│A│S│A│M│M│M│A│M│X│S│M│X│M│A│M│A│M│M│S│A│M│X│M│M│X│X│M│A│S│M│A│M│X│M│A│M│X│X│A│S│X│M│M│X│X│X│M│A│M│A│M│X│X│M│A│S│X│S│A│S│A│M│S│S│M│X│M│M│M│A│A│X│X│X│A│A│X│M│A│M│A│S│A│S│X│S│S│S│X│X│A│S│M│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│A│M│M│S│S│S│M│S│M│X│A│A│A│A│A│S│M│S│X│S│A│M│X│X│M│A│A│S│A│M│A│S│A│S│M│S│S│S│X│S│A│M│X│S│S│M│S│X│M│X│M│A│S│X│A│A│M│M│S│M│A│S│M│M│A│S│X│M│X│X│M│A│S│X│M│A│X│M│M│S│X│M│M│S│X│M│X│S│A│M│A│M│X│M│A│A│X│X│A│A│S│M│S│S│M│M│M│S│M│M│A│M│X│M│M│M│A│A│A│A│A│S│A│M│X│X│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│S│A│M│X│A│A│X│S│A│S│M│M│S│S│M│X│A│A│A│X│A│S│X│S│S│M│S│M│A│M│X│M│M│M│A│A│A│A│M│M│X│M│A│A│A│A│S│A│M│X│X│X│M│X│M│S│A│X│X│X│A│M│X│M│X│A│X│X│S│X│X│A│X│M│S│S│S│M│A│A│A│S│A│M│X│S│A│M│X│M│A│M│X│M│M│S│M│M│X│M│S│A│X│X│X│A│X│A│A│M│X│S│X│S│X│M│M│M│M│M│M│A│M│S│S│M│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│X│M│A│S│X│M│X│M│A│S│A│A│A│A│M│M│M│M│M│M│M│X│M│A│A│X│M│X│M│M│S│A│X│M│M│M│S│M│A│A│S│M│M│S│M│M│M│A│S│M│M│S│M│M│X│M│X│M│M│M│M│S│A│M│M│A│M│X│M│A│M│S│S│M│A│A│A│M│A│S│X│M│A│M│A│M│A│S│M│X│M│X│M│X│A│M│X│M│A│S│M│X│M│M│S│S│S│X│S│A│X│S│A│S│M│S│S│S│M│X│X│M│X│A│M│A│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│S│M│A│S│A│X│M│M│A│M│M│M│X│M│M│A│M│A│X│X│X│A│M│M│M│M│S│A│M│A│S│A│M│X│X│X│A│X│M│A│X│X│A│X│A│M│S│A│M│X│A│A│M│S│A│S│A│X│M│A│X│M│X│S│A│M│X│A│M│X│M│A│A│M│M│S│M│M│X│M│M│S│A│M│X│X│A│M│X│A│M│M│X│M│M│S│A│S│X│S│A│A│M│X│X│A│A│A│M│X│X│M│A│M│A│A│A│A│X│X│X│X│A│M│M│S│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│A│M│A│X│M│M│S│M│S│S│S│S│S│M│M│M│S│X│M│A│S│X│S│X│X│M│X│A│M│X│S│M│S│M│M│M│M│X│X│S│X│M│A│S│A│M│M│X│S│M│X│S│M│S│A│S│M│S│M│S│S│M│A│A│X│S│S│S│S│X│M│S│S│M│M│A│M│X│A│A│M│M│A│S│M│M│X│S│S│M│S│S│X│A│X│S│A│M│A│X│M│A│M│A│M│M│M│M│M│S│A│M│M│M│M│M│S│M│M│M│S│A│S│X│X│A│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│A│M│A│M│S│A│M│X│A│S│A│A│A│A│M│M│M│X│A│X│M│A│M│A│M│M│S│M│M│M│S│X│X│A│A│A│X│X│A│A│A│X│A│M│M│S│M│M│A│M│X│M│X│M│X│M│X│M│A│X│A│X│X│M│A│X│A│X│A│X│M│A│M│A│S│X│S│S│M│S│M│S│M│M│M│S│X│A│X│M│A│X│M│M│M│M│A│M│X│M│X│S│X│A│S│A│A│X│A│X│M│A│S│M│A│M│A│X│A│X│M│X│M│X│M│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│X│M│A│X│X│A│X│M│X│M│M│M│M│M│M│A│A│M│M│S│M│X│M│A│S│A│A│A│X│A│S│A│S│X│M│S│S│M│M│M│M│M│M│S│A│A│A│M│A│M│X│M│A│S│X│S│S│X│S│S│S│X│M│X│M│S│X│M│M│M│M│A│S│M│M│M│M│A│M│A│A│A│A│A│A│X│M│S│M│M│M│S│M│S│A│S│A│M│A│M│M│A│S│A│S│M│M│M│M│M│S│A│S│X│M│S│A│M│S│X│M│A│M│X│A│X│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│M│M│M│S│S│S│M│M│S│X│M│S│S│S│S│M│S│M│A│S│M│M│S│A│S│M│S│S│M│A│S│A│A│X│A│X│X│A│S│M│S│A│M│M│M│S│S│M│A│A│M│M│A│M│X│X│M│A│M│A│X│M│X│A│X│M│A│A│S│M│X│M│S│X│A│A│S│X│M│X│S│S│M│M│X│S│A│X│M│A│S│A│M│M│A│M│X│X│A│X│S│M│M│M│X│A│X│X│S│A│M│X│S│A│X│M│A│X│A│M│S│A│M│A│S│M│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│A│M│X│A│A│A│A│A│A│A│X│A│X│X│A│A│A│M│A│X│S│A│M│X│S│A│A│A│M│M│M│M│M│S│M│X│S│S│M│A│S│M│X│A│X│X│X│M│X│S│A│M│A│S│X│S│M│M│M│S│M│M│S│S│X│S│S│M│M│A│S│M│M│M│S│M│X│S│M│M│M│A│M│A│X│M│X│M│A│M│M│A│S│M│S│M│S│S│S│X│A│X│A│S│M│M│M│X│M│A│S│A│S│M│M│S│M│M│A│M│S│A│S│X│M│X│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│S│M│M│M│S│S│M│S│S│S│M│M│S│S│M│M│X│M│S│X│M│X│S│X│M│M│M│X│A│M│X│A│X│A│M│A│X│A│M│X│M│A│M│S│M│M│M│S│M│M│X│S│M│S│A│X│X│X│A│X│A│X│X│A│A│X│X│M│X│A│X│A│M│X│M│S│M│A│S│A│S│A│M│S│S│S│S│M│A│M│S│A│M│X│X│X│A│A│X│M│A│S│M│S│A│X│M│S│X│M│M│M│S│A│M│A│M│M│M│M│S│A│M│A│M│X│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│A│X│X│A│X│A│A│A│X│A│A│X│A│X│M│A│S│M│M│A│S│A│S│M│S│A│S│M│A│M│S│X│S│A│M│M│S│M│M│S│M│S│M│M│A│M│S│A│A│A│A│S│A│M│X│M│X│M│A│M│X│A│M│M│M│M│A│A│M│M│S│S│X│M│A│X│M│A│M│M│M│A│M│M│A│M│X│X│A│X│M│M│S│X│X│M│M│M│M│A│M│X│A│S│A│M│X│A│X│S│A│M│S│X│M│A│S│A│A│A│M│M│M│A│M│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│A│M│M│S│S│M│S│M│S│S│M│M│M│X│S│A│M│A│S│A│M│A│S│A│S│A│S│X│S│X│A│M│S│A│S│A│A│X│A│X│A│A│A│S│A│M│A│S│X│M│M│M│A│M│M│M│M│M│A│S│X│M│S│A│X│M│X│M│M│X│A│M│A│M│A│X│M│S│S│M│S│X│M│M│M│M│S│S│M│X│A│S│A│M│X│X│A│X│M│S│M│M│M│M│M│A│M│S│M│S│A│X│X│X│S│A│S│M│M│M│S│M│M│M│M│X│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│S│M│A│X│A│X│A│X│X│M│X│X│M│X│M│A│S│M│M│A│S│M│M│A│M│M│M│A│M│M│M│X│S│A│M│M│S│M│S│S│X│S│M│M│M│M│M│A│X│M│A│S│M│M│A│A│A│M│A│S│A│A│S│X│S│A│A│X│X│M│A│S│X│M│X│S│X│M│A│M│M│M│M│S│M│M│M│A│S│X│M│M│M│M│M│S│X│S│M│A│X│A│S│A│S│A│A│M│A│S│X│M│X│A│M│X│X│X│X│S│X│X│X│A│A│S│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│A│M│X│S│M│M│M│A│M│A│A│X│M│A│S│A│M│M│S│M│M│X│M│M│M│X│M│A│M│A│M│M│M│X│M│A│M│X│A│X│X│X│X│M│A│A│X│X│M│X│X│X│M│S│M│S│S│M│A│M│X│M│S│A│M│M│A│M│X│S│X│M│X│M│A│S│M│S│M│M│S│M│A│A│A│M│M│A│M│S│S│M│X│A│A│A│X│M│M│A│M│M│S│A│X│A│M│M│A│M│A│A│S│M│M│M│M│M│M│S│A│M│X│M│M│S│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│M│M│A│X│A│A│X│A│S│M│M│M│X│A│X│A│S│A│A│M│M│A│M│A│M│X│X│A│S│A│S│A│S│M│M│S│S│S│M│X│X│M│A│S│M│M│S│A│A│S│M│S│X│S│M│X│A│M│A│S│M│X│M│A│M│X│M│X│X│S│A│S│A│S│X│M│M│A│S│A│A│M│M│X│S│M│M│X│M│A│X│A│S│M│S│S│M│X│S│S│S│M│M│M│M│S│M│M│M│M│S│M│M│A│A│S│X│S│A│M│A│M│A│A│M│X│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│A│X│S│X│S│S│M│M│X│X│A│A│A│M│X│M│M│M│M│X│S│S│X│M│A│X│S│S│M│X│X│M│A│S│X│A│M│M│X│X│M│M│M│A│M│M│A│M│A│X│A│A│A│A│M│M│S│A│M│A│A│A│A│M│S│M│S│X│M│A│S│A│M│M│M│A│M│X│A│M│M│S│S│M│S│A│M│A│X│S│M│M│M│S│A│M│X│M│A│S│M│X│M│A│S│A│X│A│A│S│A│M│X│M│S│M│M│A│M│X│S│A│M│X│A│S│A│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│M│M│M│M│M│M│X│S│S│S│M│M│X│M│A│S│A│S│X│M│M│A│M│S│M│X│A│A│X│S│M│M│S│M│S│S│M│M│S│A│X│M│A│X│M│A│M│M│S│M│S│M│S│M│A│S│X│M│M│M│S│S│X│A│A│X│M│A│X│M│M│M│S│S│S│M│M│X│S│X│M│A│X│A│A│M│M│M│X│X│A│X│M│A│S│A│M│S│S│X│A│X│M│M│M│X│M│M│M│A│M│X│A│M│A│M│X│M│A│S│M│S│X│A│M│X│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│A│A│A│A│X│X│X│M│A│M│A│A│M│M│S│M│A│M│X│A│X│S│A│X│A│S│M│M│M│X│A│A│M│M│A│A│A│A│X│X│X│S│S│M│S│M│S│X│A│M│M│M│X│M│X│S│X│X│S│X│A│A│X│M│M│M│M│M│S│A│S│X│A│A│A│X│X│A│M│A│M│X│M│S│X│M│A│S│M│M│S│X│S│A│S│A│S│A│M│X│X│S│M│A│S│M│M│S│X│S│A│S│X│M│A│M│M│M│M│S│M│M│X│X│M│A│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│S│S│S│S│M│M│S│M│A│M│M│X│S│X│A│M│A│M│S│M│M│M│A│S│A│X│S│A│A│S│M│M│S│S│M│M│M│M│S│M│X│X│M│A│S│A│M│X│X│M│A│S│M│X│X│M│M│A│S│M│X│M│M│X│A│A│X│A│S│A│M│M│M│S│M│S│M│M│M│S│M│X│A│M│M│M│M│X│A│M│A│M│M│A│M│M│M│A│M│X│M│A│M│A│M│A│S│M│A│M│A│M│X│M│X│M│S│A│M│M│M│A│M│M│S│A│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│A│M│A│X│M│A│A│S│X│M│S│M│A│S│X│X│M│X│M│A│A│X│M│A│M│M│X│M│X│M│A│M│X│A│X│X│A│M│A│A│X│A│A│M│S│M│A│M│M│S│S│X│S│A│M│X│S│S│M│X│M│S│X│S│S│M│M│X│A│M│A│M│A│A│X│A│M│X│A│X│M│A│S│M│X│M│A│S│M│S│M│S│S│M│S│M│M│S│S│M│M│A│M│M│S│S│S│M│M│A│M│A│M│A│M│S│A│S│A│S│A│M│X│A│A│M│M│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│M│M│M│X│M│X│M│A│M│M│M│A│S│A│M│X│A│S│M│S│M│M│M│S│A│M│X│M│M│A│S│M│M│S│S│M│S│S│M│M│M│S│X│M│M│M│M│M│A│A│M│M│M│M│A│M│A│S│A│X│X│A│A│A│M│S│S│S│S│X│M│S│M│M│S│M│M│A│S│M│A│M│X│A│S│A│M│A│X│A│X│X│A│X│M│A│A│A│A│S│M│S│M│M│M│M│A│S│M│S│X│S│A│X│M│A│M│A│S│X│S│M│M│M│S│A│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│A│M│S│S│M│S│S│S│M│A│M│A│S│M│M│S│M│S│A│M│A│M│A│X│X│X│A│A│M│A│S│A│A│A│A│X│A│M│X│A│X│M│A│S│A│S│A│M│A│X│S│A│A│M│M│S│M│S│M│X│S│A│M│X│M│A│A│A│M│A│M│X│M│A│A│A│S│M│S│M│A│M│X│M│M│M│M│S│M│S│M│M│S│M│M│M│S│X│M│M│A│A│X│M│A│S│X│M│A│S│X│M│A│M│M│M│M│A│M│M│X│A│A│S│M│M│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│A│M│A│A│X│M│A│X│S│X│X│X│M│A│M│M│X│S│A│S│A│M│M│S│M│X│M│S│M│A│M│M│A│S│M│M│S│S│S│X│S│A│A│X│A│M│A│S│X│X│S│X│S│S│M│M│X│M│M│A│M│M│X│X│M│X│X│M│S│M│M│A│M│S│S│M│M│A│X│X│A│M│A│X│A│X│X│M│A│M│A│A│A│A│M│A│M│A│M│M│S│M│M│S│A│M│A│M│A│M│X│M│A│M│A│X│M│A│S│X│X│X│M│X│A│A│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│M│M│S│S│M│M│S│M│X│S│S│S│S│M│M│S│A│S│X│M│M│A│M│A│X│A│A│M│M│S│X│S│X│A│X│X│M│A│X│M│X│M│A│S│M│X│M│M│M│A│X│A│X│M│M│X│A│X│M│A│S│M│S│S│M│S│S│X│S│A│M│X│M│X│A│A│M│M│M│S│S│S│M│X│A│M│M│M│A│M│M│M│S│S│M│A│M│X│M│X│A│X│X│M│A│S│M│M│M│S│M│S│A│X│X│X│X│S│X│A│M│S│S│S│M│M│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│A│X│A│X│M│M│A│A│A│M│S│X│M│A│S│A│M│X│S│M│M│S│M│S│A│S│M│S│X│A│M│M│M│S│A│M│M│M│A│M│M│A│X│M│A│M│S│X│A│M│X│M│M│S│X│S│M│M│S│S│M│S│M│A│S│A│A│X│A│S│M│S│M│S│S│S│M│M│X│M│A│M│A│M│S│M│S│X│S│A│S│A│X│X│A│M│X│S│M│X│S│S│X│S│M│A│X│A│A│S│A│M│X│M│S│M│S│M│A│M│S│M│A│A│M│X│M│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│M│X│S│M│M│S│M│S│M│M│A│S│A│M│X│S│A│S│A│X│A│A│M│X│S│X│X│M│M│X│A│M│M│S│S│X│M│A│M│M│M│X│S│A│M│M│M│X│M│M│A│X│M│M│S│A│M│X│A│X│X│M│A│M│M│M│M│M│M│A│A│A│X│A│M│X│M│A│M│A│M│A│M│A│A│A│X│A│S│X│M│S│X│M│A│M│A│A│X│X│A│A│X│M│A│S│X│M│M│M│M│A│M│A│A│A│A│X│A│M│M│M│M│M│X│S│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│M│A│S│X│A│A│X│M│A│S│A│M│X│S│A│M│A│S│M│S│M│S│M│M│M│M│M│M│M│S│M│S│A│A│M│M│S│A│S│A│X│A│M│A│A│A│M│X│M│S│M│X│M│A│M│A│M│S│M│M│S│M│M│S│A│M│X│A│M│M│M│M│M│A│M│X│S│M│S│X│S│A│S│M│M│M│M│M│M│X│M│M│A│S│A│M│X│X│S│S│M│M│M│M│X│S│X│A│X│A│S│A│S│M│S│M│S│S│S│S│X│X│S│X│M│M│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│M│A│X│X│S│S│X│M│A│M│X│S│M│M│M│M│A│M│M│M│A│M│M│A│M│X│A│A│X│A│X│M│M│M│X│A│X│A│S│A│S│X│S│S│M│S│S│M│A│A│M│X│M│M│S│A│M│X│M│A│A│A│X│S│X│S│S│M│S│M│X│X│M│A│M│X│S│X│A│A│A│A│M│X│S│S│X│X│A│X│A│S│A│M│M│S│S│X│M│A│S│M│X│M│A│M│M│S│M│M│X│A│M│X│A│X│X│X│A│X│M│X│M│A│M│A│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│M│S│S│M│M│X│X│M│A│M│A│M│X│M│A│S│A│X│X│M│A│M│A│S│M│S│S│S│M│M│S│X│S│S│M│S│S│M│M│M│A│M│X│X│M│A│A│M│M│M│S│M│A│X│A│A│X│A│M│S│S│S│M│M│X│X│X│M│A│M│M│S│S│M│X│X│M│M│M│S│M│M│M│X│A│M│M│M│M│S│M│M│A│S│X│A│A│X│A│X│A│X│A│S│A│S│A│X│X│S│S│S│M│S│S│S│M│M│S│M│S│A│S│A│M│X│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│A│A│X│M│A│S│A│M│X│X│M│A│S│A│S│M│S│M│S│S│S│S│S│X│M│A│A│A│M│A│X│M│A│A│S│A│A│A│A│A│X│M│M│A│M│S│M│S│M│S│A│M│M│S│M│S│M│M│A│M│A│M│X│A│M│X│S│M│S│A│S│M│M│A│S│X│A│X│X│A│M│A│S│X│M│M│S│A│A│A│A│M│M│M│M│M│X│S│A│M│X│X│S│A│S│A│M│A│S│M│M│A│A│X│X│X│A│X│A│A│A│S│A│S│A│S│A│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│X│M│S│M│M│A│S│A│A│X│A│S│X│S│X│M│A│A│A│A│A│A│A│M│M│M│S│M│S│S│M│M│M│S│M│S│S│S│M│S│M│M│M│M│A│A│M│A│M│X│X│A│A│A│A│X│X│A│X│A│X│X│X│M│S│M│A│X│A│M│M│M│A│M│X│X│M│M│M│S│M│M│A│A│X│M│X│S│S│M│S│M│M│A│X│M│X│A│M│A│M│M│X│M│X│M│M│M│A│M│S│M│M│M│S│X│M│S│S│M│S│X│S│A│M│M│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│A│M│A│X│S│A│M│X│M│M│A│S│X│M│M│S│M│M│M│M│X│M│X│M│M│X│X│X│M│A│X│A│M│X│A│A│A│A│A│A│A│X│S│M│M│S│M│A│M│S│M│S│M│S│M│M│S│S│X│M│S│M│S│M│M│X│S│S│S│M│M│M│A│S│X│M│X│A│M│M│A│S│M│M│M│M│A│X│M│X│A│A│S│X│S│A│M│A│M│X│X│M│M│S│A│M│M│S│M│M│A│A│A│A│X│X│M│A│M│X│X│A│M│X│M│A│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│A│S│M│M│S│X│A│A│S│M│A│M│A│A│A│X│A│S│X│M│S│M│X│X│S│A│M│X│S│A│M│M│S│M│M│M│S│M│S│S│S│M│M│A│M│X│X│X│M│S│A│M│A│A│X│M│A│X│A│A│A│A│A│A│X│S│A│A│A│A│X│S│A│M│M│X│S│X│S│S│M│X│A│S│A│M│S│S│M│M│S│M│M│A│S│M│M│S│M│S│S│X│A│S│A│S│A│A│M│S│S│S│M│S│M│X│M│S│X│S│M│S│M│M│X│M│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│A│S│X│A│M│A│S│M│A│M│A│S│X│M│M│S│A│M│A│X│A│A│X│A│M│X│S│X│M│S│M│S│X│M│M│A│X│X│A│A│M│A│S│A│M│X│S│M│X│M│A│M│S│X│X│M│A│M│M│X│M│X│X│M│M│A│M│S│M│M│M│X│A│S│X│A│S│A│M│A│X│S│A│M│A│M│M│A│A│M│M│X│M│M│M│M│M│X│A│M│X│M│X│S│X│M│M│X│M│A│X│M│A│M│A│S│M│M│A│S│A│A│M│A│A│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│A│M│A│M│S│A│M│X│X│S│A│S│X│S│X│M│A│S│X│S│M│A│M│M│M│M│S│X│S│A│X│X│A│M│M│S│S│M│S│S│M│X│S│A│S│A│M│A│X│M│M│M│X│X│A│M│A│S│X│S│S│X│S│A│X│M│X│M│A│S│X│S│M│M│M│A│S│A│S│A│M│A│X│M│A│S│M│S│M│M│A│A│X│A│A│A│X│M│A│M│M│S│X│M│A│S│M│S│M│S│S│M│A│S│M│M│A│M│X│M│M│M│S│S│X│S│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│S│M│X│X│M│X│S│X│A│M│X│S│A│M│X│S│X│M│A│S│M│A│S│X│S│A│M│X│M│M│X│S│A│M│X│A│A│A│A│A│M│X│X│M│M│M│S│S│X│S│A│M│X│M│S│M│A│S│X│A│A│A│X│X│M│X│M│S│A│M│X│M│A│A│M│X│S│X│M│X│S│M│X│M│X│S│M│A│M│X│S│M│S│S│X│S│M│S│X│M│A│M│A│S│M│M│A│A│A│X│S│M│A│S│X│M│M│M│A│S│M│M│X│M│A│A│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│A│M│S│S│S│M│M│M│M│M│A│M│X│M│A│M│A│S│A│M│X│A│S│A│A│M│X│A│S│X│M│A│X│M│A│S│X│M│X│S│M│M│X│X│A│A│X│A│A│S│M│X│A│A│A│M│M│M│M│X│M│M│M│M│A│X│A│M│M│S│A│M│S│X│M│A│X│A│X│X│A│M│S│S│M│X│X│A│M│M│X│A│X│A│X│M│M│M│A│S│X│S│A│M│A│M│S│M│S│M│X│M│M│S│X│S│X│M│A│M│A│M│A│M│M│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│A│S│M│A│A│A│A│A│A│A│A│M│A│M│A│S│X│A│S│X│M│M│S│M│S│M│X│X│A│M│X│S│A│S│A│X│A│A│A│M│A│M│S│M│M│S│M│M│M│M│X│S│M│S│S│S│S│S│M│A│S│X│X│S│M│X│M│M│X│M│A│X│A│A│M│S│S│M│M│X│A│M│A│A│M│X│S│X│S│A│M│A│M│M│M│M│A│X│A│S│X│M│A│S│M│M│M│M│A│A│A│X│A│M│M│S│A│M│X│S│A│M│X│S│S│X│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│S│M│M│M│M│S│S│S│M│S│A│S│A│S│A│S│A│M│M│M│M│A│S│A│A│A│S│M│M│M│A│M│X│M│S│S│M│M│M│M│A│M│S│X│A│X│A│X│M│A│X│A│X│A│A│X│A│A│S│A│M│S│X│M│X│S│A│A│A│M│S│A│M│X│X│M│A│M│S│S│M│M│S│S│M│M│M│A│A│X│M│S│M│A│S│M│M│M│A│M│X│S│A│M│M│A│A│X│M│M│M│S│X│M│A│S│X│M│X│S│X│S│A│A│X│M│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│A│A│M│X│X│A│X│A│A│M│X│X│X│M│A│S│X│X│A│A│A│S│M│S│M│A│M│A│S│M│M│M│A│X│M│X│M│A│X│S│M│M│X│M│A│M│M│A│M│X│M│M│M│M│S│M│S│M│M│X│S│A│S│A│A│X│M│M│M│X│A│X│X│M│S│S│M│M│X│A│A│A│A│A│M│S│M│S│M│M│M│M│M│X│X│A│X│M│M│A│A│M│M│S│S│S│S│X│S│A│M│M│X│M│A│S│A│M│X│M│A│M│M│M│M│A│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│S│M│M│S│X│M│M│M│M│M│M│M│M│S│M│M│X│S│M│S│M│M│A│M│X│X│X│A│M│M│S│X│M│M│M│M│S│A│X│S│X│S│A│A│X│M│S│M│M│A│A│X│A│M│A│M│X│A│A│S│X│M│M│M│S│X│S│A│S│M│M│M│X│X│A│A│A│X│M│X│M│M│M│S│M│A│A│X│A│S│X│S│A│M│S│S│X│M│M│M│A│X│S│A│X│A│A│A│S│A│M│S│A│M│X│S│X│M│A│M│A│M│A│A│M│X│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│X│M│A│S│A│A│A│M│A│A│A│A│A│A│A│M│X│M│A│X│A│S│A│M│S│S│M│A│X│A│M│A│M│X│A│M│M│M│S│M│A│S│X│M│X│X│A│A│M│X│S│X│M│S│M│S│S│M│X│A│M│X│M│A│X│A│S│A│S│A│S│A│S│M│S│S│M│M│X│S│S│M│A│X│X│M│S│M│A│S│A│M│M│X│A│M│X│X│A│X│A│X│M│A│M│S│M│M│S│A│M│A│A│A│A│M│M│S│A│S│M│S│X│S│A│A│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│M│M│A│M│X│S│M│S│S│X│M│X│X│S│X│M│X│S│M│S│A│M│A│S│A│X│S│S│M│S│S│S│X│S│M│S│A│M│X│M│A│M│A│S│M│S│S│S│M│M│X│A│A│A│A│M│A│M│A│M│S│X│M│A│S│M│M│X│S│X│M│A│S│A│M│A│M│X│X│A│A│M│A│S│A│S│X│M│A│M│A│M│X│M│M│S│M│M│M│M│X│X│X│M│A│X│X│X│M│A│X│S│S│M│M│S│A│S│X│S│X│M│A│M│X│M│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│M│M│M│M│M│A│M│X│M│X│S│S│M│X│A│X│A│X│A│M│A│S│X│M│M│M│A│X│X│X│A│M│A│M│A│S│X│S│X│M│A│S│X│A│A│X│A│A│A│A│X│M│M│M│M│X│A│M│S│X│S│A│M│A│S│X│M│A│S│A│M│X│M│M│X│S│M│M│M│S│X│M│A│S│X│M│A│M│M│S│S│M│X│M│A│X│A│A│S│M│M│S│X│S│A│X│A│X│S│S│M│A│X│A│X│M│A│S│X│M│X│M│A│M│M│S│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│A│S│A│M│M│M│A│M│X│M│X│X│A│A│X│A│M│M│S│X│S│X│M│A│S│X│X│M│A│S│M│A│M│X│M│A│M│X│S│M│S│X│A│X│M│M│M│X│M│M│M│X│M│X│S│A│M│S│M│X│A│S│M│M│A│S│A│M│A│S│M│M│A│M│A│X│M│A│X│A│A│M│S│M│X│M│S│S│M│A│A│A│M│S│M│X│M│S│M│M│A│A│M│A│M│S│M│S│M│M│M│A│M│S│M│M│M│A│M│A│S│M│M│A│X│M│A│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│S│A│S│M│S│X│M│A│S│M│S│S│M│M│X│M│X│A│A│M│M│M│M│X│X│S│A│M│X│S│S│M│X│M│X│S│A│X│M│A│S│M│M│S│A│M│S│S│M│S│A│S│A│S│A│M│X│A│M│A│M│X│M│S│S│M│M│A│M│A│X│A│M│M│X│S│A│M│X│M│X│A│A│S│M│M│A│S│M│S│S│M│A│A│A│X│A│M│S│M│M│M│X│M│A│X│M│A│A│A│A│M│X│A│X│M│X│S│A│M│A│X│A│S│M│M│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│A│M│A│M│X│A│M│S│X│S│A│A│M│M│A│X│X│X│M│M│M│A│A│X│M│X│M│X│M│M│M│M│A│A│S│A│M│M│S│M│A│A│X│A│S│A│S│X│A│A│S│A│M│X│S│A│M│M│A│M│S│M│A│M│A│X│A│M│S│S│S│M│S│X│M│A│S│X│M│X│S│S│M│S│M│A│M│A│M│X│X│X│M│M│S│M│X│A│X│A│X│X│M│A│M│X│M│S│S│M│S│A│M│X│S│A│M│A│M│A│S│X│M│M│S│A│A│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│M│A│M│M│S│M│M│A│M│M│M│S│M│S│S│M│A│S│M│S│S│M│M│A│A│M│A│M│A│A│M│M│M│S│A│S│X│A│M│M│X│M│X│S│M│M│M│M│M│M│X│M│M│S│X│M│S│X│M│A│S│A│S│M│M│S│M│M│A│A│A│A│M│X│A│M│X│S│X│M│A│X│X│X│X│M│S│S│S│M│M│S│M│A│X│X│S│M│M│M│M│S│A│X│S│A│M│X│M│X│M│S│A│M│A│M│M│S│A│M│M│A│X│S│M│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│S│M│S│A│A│A│X│A│M│X│X│X│X│A│A│M│A│M│M│X│A│M│X│S│M│S│S│S│S│X│S│A│X│S│A│M│X│M│S│S│X│X│A│X│X│A│A│X│M│M│S│S│M│M│X│X│M│A│M│M│M│M│M│A│A│X│A│X│S│M│M│M│S│M│A│S│A│S│A│X│X│A│X│X│X│X│X│A│A│X│A│A│M│X│S│X│M│A│X│A│X│M│X│M│X│X│X│A│X│A│X│M│M│M│X│M│M│M│A│M│S│X│M│X│X│X│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│A│A│A│M│X│M│S│X│M│S│M│X│M│M│S│M│M│A│S│X│M│A│M│A│X│A│A│M│M│M│A│M│A│A│M│A│M│A│X│A│A│M│X│M│A│M│X│S│S│M│A│A│A│A│X│X│M│A│S│X│X│S│S│S│M│S│S│X│M│A│S│X│A│X│X│M│M│A│S│A│M│X│M│S│M│S│M│M│X│M│M│S│M│S│A│M│A│S│A│M│S│M│S│S│M│S│S│S│S│S│M│S│A│X│S│A│S│A│S│M│M│S│A│S│X│S│S│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│M│X│M│A│X│A│A│S│A│M│A│M│M│A│S│X│X│S│M│S│X│M│X│M│M│M│S│A│X│M│M│S│S│S│M│M│X│M│M│A│X│S│X│X│S│A│M│X│M│M│X│M│M│X│S│M│A│A│X│A│A│A│A│X│A│M│A│X│S│A│M│X│M│A│X│M│X│M│M│M│A│S│A│M│A│A│S│M│M│A│X│X│M│A│X│A│M│M│X│X│A│M│A│A│A│A│X│A│A│A│M│A│M│S│A│M│A│M│M│X│M│A│X│A│A│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│X│M│A│S│M│M│M│X│A│S│A│X│M│X│S│X│A│X│X│X│A│S│A│M│A│X│M│A│M│X│A│X│X│A│A│A│X│M│X│A│A│M│A│A│M│A│M│M│X│S│A│A│S│M│M│A│S│X│M│M│M│S│M│M│M│S│A│M│A│X│S│S│M│S│S│S│M│S│A│S│X│S│X│S│S│M│M│A│S│X│M│S│S│M│M│S│S│M│A│M│M│M│M│S│M│S│M│M│M│M│M│S│M│M│A│M│M│X│M│A│M│M│M│M│S│M│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│A│S│X│A│M│A│M│A│M│X│M│X│S│M│A│M│M│M│M│S│M│M│M│A│S│X│X│M│X│A│M│S│S│S│S│M│M│M│M│M│S│X│M│S│M│S│X│M│A│A│M│M│X│M│A│X│A│M│X│S│X│X│A│X│A│X│M│A│S│M│M│A│X│A│A│X│A│S│A│M│X│M│S│M│M│M│M│X│A│M│A│X│A│A│X│A│A│A│M│M│S│X│S│X│X│A│X│M│A│A│A│X│A│A│S│X│M│M│A│S│X│S│X│X│A│A│X│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│S│M│M│S│A│M│A│S│A│A│X│X│M│A│M│A│A│X│X│S│A│S│M│M│X│X│X│S│M│X│M│A│X│X│A│A│X│M│M│M│A│M│X│A│M│X│M│M│S│X│S│S│S│S│M│A│S│X│M│A│X│M│S│S│M│S│A│M│X│M│X│M│M│A│S│M│M│M│X│A│X│X│A│M│A│M│M│A│S│M│M│M│S│M│M│S│X│M│X│A│A│M│A│M│M│M│X│S│S│X│M│S│X│M│S│A│S│X│S│A│M│A│M│M│S│S│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│A│M│A│M│S│X│S│A│S│M│S│M│M│S│S│M│S│M│S│M│M│X│S│X│A│X│S│M│S│X│A│M│A│M│S│X│M│S│M│A│S│A│M│S│A│S│X│S│M│X│A│A│A│M│A│S│A│M│A│M│X│M│X│A│M│M│M│M│X│X│M│S│A│S│A│M│X│M│X│X│X│X│X│A│M│A│S│M│M│M│M│A│A│A│A│X│A│A│M│S│M│M│M│X│M│A│A│X│X│A│M│X│X│M│X│S│X│M│A│S│X│S│A│S│M│A│M│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│S│M│M│X│M│S│A│M│X│M│A│X│A│X│A│M│M│S│X│S│X│M│M│M│M│M│A│M│S│X│M│X│A│S│A│X│X│M│M│X│A│M│S│A│M│X│A│A│M│M│M│M│X│M│M│M│S│A│M│X│X│M│A│S│M│A│S│A│M│X│A│X│M│A│S│M│S│S│M│A│M│S│A│M│X│M│M│A│A│S│X│S│S│S│M│S│A│M│X│X│X│S│X│M│M│M│M│M│A│X│M│A│S│A│M│A│M│M│M│M│S│A│S│M│A│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│A│M│M│A│M│M│A│M│M│M│S│X│M│M│S│M│A│S│A│A│M│X│A│A│A│M│S│M│M│X│S│X│A│S│X│M│A│S│X│S│S│M│M│A│M│S│M│M│M│A│A│X│X│A│M│X│M│A│M│S│A│S│M│M│M│A│X│A│S│M│M│M│S│A│M│X│A│M│M│A│M│A│S│X│S│X│S│S│M│M│X│A│A│A│X│X│S│A│X│M│A│M│X│X│A│S│X│M│M│M│S│S│M│A│S│X│M│X│A│A│M│A│M│M│X│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│S│M│S│A│S│M│M│M│M│M│M│A│X│A│X│S│A│M│X│M│A│M│X│M│X│M│A│A│M│A│S│M│M│M│A│M│M│M│A│M│X│A│X│X│X│A│X│M│S│S│S│S│X│M│A│M│S│A│M│X│A│S│A│S│M│S│S│M│M│M│X│A│M│A│S│M│M│S│S│M│S│A│M│M│M│A│A│M│A│A│M│A│M│M│M│M│M│S│M│S│A│S│A│M│X│M│A│A│X│M│X│M│A│M│M│M│X│M│M│M│M│A│M│M│X│S│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│A│M│A│M│X│X│M│A│M│A│S│A│M│S│M│M│X│S│X│X│S│M│S│M│S│S│X│S│M│A│X│A│A│S│M│M│S│A│A│A│S│M│M│M│S│A│S│A│M│A│X│A│A│X│A│M│M│X│M│A│S│M│M│M│A│X│A│X│A│X│M│X│S│A│M│A│X│X│A│A│M│X│X│A│A│S│M│S│S│M│S│A│M│X│A│X│A│A│M│A│A│M│A│S│M│S│S│M│S│M│A│A│A│M│M│X│S│A│A│A│S│M│M│S│A│S│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│M│A│S│X│S│M│M│S│M│M│S│A│M│X│M│M│M│M│M│X│M│A│A│A│A│A│A│X│M│X│S│S│M│S│M│A│S│X│M│M│A│A│M│X│X│S│M│M│M│M│M│S│M│M│M│S│A│M│X│X│X│X│X│M│X│S│M│M│X│S│A│X│M│A│S│M│M│S│M│M│M│A│X│S│M│M│A│X│M│A│S│M│S│S│M│M│M│S│M│M│S│M│A│A│A│A│X│A│A│X│S│X│M│S│X│A│X│M│X│M│S│A│A│M│A│S│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│X│A│M│A│M│A│A│A│X│X│M│A│S│M│X│S│A│M│S│M│M│S│M│S│M│M│M│M│X│M│A│X│A│X│M│A│S│X│M│X│X│A│M│X│M│A│X│A│A│A│A│A│M│X│X│M│M│M│M│M│S│M│X│X│A│M│X│A│M│M│M│M│X│M│A│M│A│X│A│A│M│M│X│M│A│M│M│M│M│A│M│X│A│X│A│M│A│M│X│A│M│M│M│M│M│M│M│S│M│X│M│A│M│X│M│A│S│M│S│A│M│X│M│M│X│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│M│A│M│A│S│M│M│X│S│S│X│M│X│A│A│M│S│M│A│A│M│A│M│A│M│X│S│X│X│A│M│M│S│M│M│A│S│A│M│X│S│S│S│M│M│M│X│S│S│S│M│M│S│M│S│M│M│A│A│A│A│A│M│S│M│M│X│M│S│A│X│X│M│X│A│M│X│S│S│M│X│S│A│S│X│M│S│M│M│A│S│M│S│S│S│M│A│S│M│M│M│A│X│X│X│A│A│A│X│A│S│A│M│X│S│X│S│A│M│X│S│A│M│X│X│A│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│S│X│S│M│S│A│S│A│A│X│X│M│M│M│M│M│M│S│X│M│X│A│S│A│M│S│A│M│S│X│S│A│X│X│M│A│S│A│M│A│M│X│A│A│X│X│X│X│A│X│M│X│A│M│A│A│S│M│M│S│S│X│M│A│A│M│A│M│M│M│S│M│A│S│X│S│A│M│X│X│A│M│A│S│X│M│A│S│X│X│S│A│A│A│M│M│X│M│A│S│X│S│S│M│S│S│S│S│M│M│S│A│M│X│X│A│X│X│X│M│M│M│M│S│M│S│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│X│X│M│A│M│A│M│M│S│M│X│X│A│A│X│X│M│A│S│M│S│M│S│A│S│X│A│M│A│A│M│A│S│A│M│X│S│M│M│A│X│S│S│M│M│X│S│M│A│M│X│S│S│X│S│X│M│M│A│A│A│A│S│M│S│M│A│S│A│A│M│A│M│A│M│X│A│S│A│M│M│S│M│M│X│S│X│S│X│A│M│M│M│X│M│M│A│M│X│M│S│A│A│M│A│M│A│X│A│X│S│X│M│M│X│M│M│M│M│X│M│A│X│A│A│A│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│M│M│M│A│M│A│M│X│A│M│M│M│S│X│S│A│S│X│A│X│A│A│S│X│M│M│M│M│M│M│M│X│M│A│M│A│X│X│S│M│X│X│M│M│M│M│M│M│M│M│M│A│M│M│M│X│X│M│S│M│S│X│M│A│A│M│X│M│X│M│A│S│X│M│A│M│M│M│A│X│A│A│A│M│A│S│M│M│M│S│M│S│M│S│S│M│S│A│M│X│X│M│M│M│S│M│M│X│A│M│X│A│X│X│M│X│A│X│A│A│X│M│S│M│M│M│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│A│A│A│M│A│S│A│S│M│X│S│A│A│A│M│M│A│M│A│S│X│M│X│M│A│S│A│X│A│A│A│X│M│S│S│S│M│S│A│S│X│X│X│A│A│X│A│X│A│A│A│M│M│S│A│M│X│M│X│M│A│M│A│M│S│M│M│S│X│A│X│A│X│M│A│S│M│S│S│M│M│S│S│S│M│A│S│A│X│A│M│A│S│A│A│A│A│X│M│A│M│X│A│M│X│X│A│X│S│S│M│S│S│M│M│A│M│X│M│S│X│M│M│A│M│X│M│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│S│X│S│A│M│A│S│A│M│X│M│M│S│S│M│A│M│A│M│X│X│M│S│A│S│X│S│M│S│X│S│A│A│A│X│A│A│A│M│M│M│S│S│M│S│S│S│S│S│X│S│A│S│A│S│A│A│A│M│A│M│A│X│A│A│A│S│X│S│M│S│M│S│A│X│X│A│A│S│X│X│A│X│M│X│S│M│M│M│M│A│M│M│M│M│M│M│S│A│S│M│X│S│A│S│A│M│X│X│A│A│M│A│M│S│S│M│A│X│A│S│X│A│X│X│M│X...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│A│X│M│X│M│X│M│M│M│X│M│S│A│X│X│X│M│A│X│X│M│A│M│X│M│M│M│X│X│X│M│M│M│S│M│M│M│A│A│X│A│A│A│M│A│A│A│X│X│A│M│A│S│A│M│X│S│M│S│M│S│X│S│S│M│M│S│A│M│A│X│A│X│A│M│M│S│M│M│S│M│M│X│M│X│S│X│A│X│M│A│S│X│X│M│A│M│S│A│S│A│A│M│A│M│S│M│X│M│M│M│S│S│M│A│A│A│M│M│A│M│M│M│M│M│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│S│M│S│M│X│M│A│X│X│A│X│M│A│S│M│X│M│S│M│A│A│S│M│S│S│M│S│A│S│M│X│S│A│M│A│X│X│X│S│M│M│M│S│M│M│M│M│M│M│S│M│X│M│X│M│X│X│M│A│A│X│X│X│X│M│M│M│A│M│S│M│M│M│S│M│M│X│A│A│X│X│M│A│M│X│M│S│S│S│M│A│A│X│S│A│S│X│M│M│M│M│M│M│M│M│A│M│A│X│X│X│A│M│M│S│S│S│X│M│A│M│A│M│A│X│M│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│A│A│A│A│A│S│X│M│M│S│S│X│M│A│X│A│A│A│A│X│A│M│A│A│A│X│X│A│S│A│A│M│A│S│X│M│S│M│M│A│S│A│X│A│A│X│A│X│X│A│M│S│A│M│X│M│M│S│M│S│M│M│S│M│S│S│S│X│M│M│A│A│A│M│A│S│X│M│M│S│A│M│X│S│A│A│A│X│S│M│M│M│M│S│A│X│M│X│A│X│A│A│A│A│S│A│S│M│S│M│M│M│S│M│A│M│X│A│X│A│S│M│S│M│S│M│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│M│S│M│S│M│M│A│A│S│M│M│M│X│A│X│M│M│M│S│S│M│S│M│S│S│M│M│X│M│M│M│S│X│M│M│A│S│A│S│A│M│X│S│S│M│S│X│M│X│A│S│X│X│M│A│M│X│A│X│X│A│A│A│X│A│M│M│M│M│S│S│M│S│S│M│M│S│M│A│S│M│M│A│S│X│S│S│S│S│X│X│S│A│M│A│M│X│S│S│M│X│S│S│X│S│X│X│A│A│A│S│X│A│M│M│S│M│M│S│A│M│M│A│M│X│M│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│A│X│A│A│A│M│S│X│M│A│A│M│M│M│S│M│S│A│M│X│A│X│A│A│M│X│X│X│X│X│X│X│X│A│M│A│M│X│M│M│S│M│X│M│A│M│M│S│M│M│M│M│A│S│X│X│A│M│X│S│S│M│M│M│M│S│A│M│X│A│M│M│X│M│M│A│M│X│A│S│M│S│M│S│X│M│X│A│M│A│X│M│S│M│A│S│X│A│A│M│M│M│M│X│X│A│M│S│M│M│M│S│X│S│X│S│A│X│A│A│X│S│S│M│X│M│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│M│M│S│M│M│X│M│A│S│M│M│S│A│A│A│A│M│M│M│M│A│M│M│M│S│X│M│M│M│M│M│M│X│X│M│X│M│X│X│X│A│A│M│M│A│M│A│X│X│A│A│M│X│M│M│S│S│X│X│M│A│A│X│S│X│S│M│S│M│S│S│M│X│M│M│S│X│M│A│S│A│M│X│M│A│S│M│S│M│S│M│A│X│S│A│S│M│M│M│M│A│A│M│A│M│X│M│A│A│A│A│M│M│S│A│S│M│M│M│S│M│A│X│X│M│A│S...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│A│A│X│A│S│M│S│A│M│A│M│S│M│M│S│S│X│M│A│M│A│A│M│A│M│A│A│A│A│A│A│A│A│M│S│M│S│A│M│S│S│S│S│M│S│M│M│S│S│M│M│M│S│A│A│A│X│A│M│X│X│S│A│M│X│M│A│S│A│M│A│A│M│X│A│M│A│S│A│M│X│M│X│S│A│M│A│X│A│A│M│X│M│M│M│S│A│A│X│S│M│S│M│X│M│A│S│M│S│M│X│S│A│M│M│M│X│M│S│M│X│M│A│M│S│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│S│M│S│A│X│M│A│X│S│A│M│X│A│X│M│X│M│S│M│X│M│M│M│A│X│X│M│M│X│X│M│M│M│X│A│A│A│X│M│A│M│X│M│A│X│S│M│A│A│A│A│A│S│M│M│S│M│S│M│A│X│M│A│M│S│S│M│X│S│M│X│M│X│M│A│X│M│M│M│S│S│X│M│M│S│S│S│X│S│A│S│X│A│A│A│S│X│M│M│S│A│M│M│S│A│A│X│A│X│A│A│M│X│M│A│M│X│X│S│A│M│X│M│A│A│A│A...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│M│A│M│X│M│A│X│X│M│A│S│X│S│M│S│X│M│A│S│A│M│X│X│S│S│M│S│X│S│S│M│S│M│S│M│M│M│X│M│A│M│M│M│S│M│A│M│S│S│M│M│X│S│X│M│A│A│A│M│A│X│X│S│M│A│X│X│X│M│X│S│X│M│A│M│X│A│M│X│S│A│M│S│A│M│X│X│X│M│A│M│X│S│M│M│S│X│X│X│M│A│M│A│S│M│S│M│M│M│M│M│S│M│S│A│S│X│A│M│A│M│A│X│S│S│S│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│M│M│X│M│S│S│M│S│X│S│X│M│A│X│M│M│X│M│A│S│M│M│S│A│A│A│A│S│A│M│X│A│A│A│A│X│X│X│M│M│S│M│A│S│A│S│A│M│X│A│A│S│A│S│M│S│M│S│X│S│M│S│A│M│M│M│A│M│M│M│A│M│A│M│A│S│X│M│M│M│S│A│M│M│X│S│M│S│S│M│A│S│A│M│X│S│X│A│S│X│M│S│M│M│M│A│X│A│X│M│X│A│X│A│A│A│S│M│S│M│S│M│X│X│A│A│A│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│X│S│A│M│X│M│A│A│M│S│A│M│X│M│A│A│X│M│A│S│A│A│S│M│X│M│M│M│S│M│M│S│M│S│M│S│A│A│S│A│A│S│X│M│M│X│M│A│S│M│M│M│A│S│A│A│A│X│A│A│A│M│A│M│A│X│A│A│A│M│A│S│X│M│A│S│X│A│A│X│S│A│M│X│A│A│X│M│A│S│A│S│A│S│X│A│M│M│M│A│A│A│X│S│M│A│S│X│S│A│M│X│S│M│M│A│M│A│A│A│X│A│M│S│M│S│M│M...
├─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─┼─...
│S│S│M│S│A│M│X│M│A│S│X│M│S│S│X│M│X│S│A│M│M│M│S│X│A│X│A│X│X│X│M│A│X│X│A│X│X│S│M│S│X│S│X│X│X│X│M│A│S│X│S│M│X│M│M│M│S│M│M│M│X│M│A│S│X│S│M│S│S│S│M│S│M│M│S│S│X│S│M│M│S│A│M│M│M│S│M│S│X│M│X│S│M│M│M│X│X│X│S│M│M│M│S│X│S│M│X│X│M│X│M│M│M│X│X│A│M│S│M│S│M│X│M│X│X│X│M│S...
└─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─...
#+end_example

Example:

| X | M | A | S | A | M | X |   |   |   |
|---+---+---+---+---+---+---+---+---+---|
| M | M | X | X | X | M | M |   |   |   |
| A | X | A | X | A | X | A |   |   |   |
| S | X | X | S | X | X | S |   |   |   |
| A | X | A | X | A | X | A |   |   |   |
| M | M | X | X | X | M | M |   |   |   |
| X | M | A | S | A | M | X |   |   |   |
|   |   |   |   |   |   |   |   |   |   |
|   |   |   |   |   |   |   |   |   |   |
|   |   |   |   |   |   |   |   |   |   |


*** References

- [[https://groups.google.com/u/1/a/jsoftware.com/g/forum/c/qAD0zNTDF2A][J Mailing List]]
- [[https://code.jsoftware.com/wiki/Guides/GettingStarted][J Wiki]]

*** Diary :noexport:

- *Thu Dec 19 19:12:35 -03 2024*

  I learned a lot today! So, I got inspired by the code_report
  solution. It's pretty cool, the idea is basically rotating the
  matrix in all of the expected directions and checking for existing
  'XMAS' occurrences.

  The verb I came up with is this one:

  #+begin_src j
  p1=. +/@:(+/@:('XMAS' E."1  (], |:, |."1, |:@:(|."1), >/., >/.@:|:, >/.@:(|."1), >/.@:(|:@:(|."1)))))
  #+end_src

  Pretty crazy, yeah. Well, the guys from J Forum helped me. I was
  able to rotate the matrix in 90o for every direction, but I was
  missing the diagonals. While watching the code_report video, I found
  out that rotating the matrix in a diagonal angle is called an
  *anti-diagonal*, which is something I still have to research I
  guess.

  I created a verb that applies all of the rotations to the noun and
  return them all at once, which is this part of the verb:

  #+begin_src j
	(], |:, |."1, |:@:(|."1), >/., >/.@:|:, >/.@:(|."1), >/.@:(|:@:(|."1)))  
  #+end_src

  The comma separation and the parentheses make this a *tacit train*
  or *verb train*, which will return all of the results of each verb
  in a single composition of a verb. So, let's look at each one:

  - *]*

    This is the identity function, it will return the same matrix.
    
 - *|:*

   Transpose matrix. Now, rows will be columns and so forth

 - *|."1*

   Reverse matrix row-wise. We have to use *"1* to apply to the first
   rank, instead of the 0th rank.

 - *|:@:(|."1)*

   Compose |: with |."1 using @:. This way, we'll first reverse the
   matrix and then transpose it.

   _I think we might have some mistake here, because reverse might not
   be the correct operation._
   
** Clojure

Ways that XMAS can be read:

- X M A S
  . . . .
- S A M X
  . . . .
- X . . .
  M . . .
  A . . .
  S . . .
- S . . .
  A . . .
  M . . .
  X . . .
- X . . .
  . M . .
  . . A .
  . . . S
- S . . .
  . A . .
  . . M .
  . . . X
- . . . X
  . . M .
  . A . .
  S . . .
- . . . S
  . . A .
  . M . .
  X . . .

So, there are 4 orientations that we can make with the arrays, and
then, we have to invert them.

We'll generate arrays of strings, that will be the orientation, and
count the occurences with this function:

#+begin_src clojure
      count-xmas (fn [arr] (apply + (map #(count (re-seq #"XMAS|SAMX" %)) arr)))
#+end_src

- The first one is trivial, we just read and split the array.
- The second orientation is vertical, so we must read the string in "columns":
  - We first read and split it the same way.
  - Then, we compose use a map-indexed with a map insided, joining all
    of them in array of charts and joining them together with another
    map (there might be better solutions to it)
- Diagonal is trickier
  - 
#+begin_src clojure
(let [raw        (slurp "input/4")
      regular    (clojure.string/split raw #"\n" )
     ;; vertical   (map-indexed (fn [in it] (map #(nth % in) regular)) regular) This might be the diagonal
      vertical     (map clojure.string/join (map-indexed (fn [i it] (map #(nth % i) regular)) regular))
      count-xmas (fn [arr] (apply + (map #(count (re-seq #"XMAS|SAMX" %)) arr)))]
  {:part-1 (+ (count-xmas regular) (count-xmas vertical))})


(let [in ["XMAS"
          "XMAS"
          "XMAS"
          "XMAS"]
      diagonal ["X"    ; [0 0]
                "XM"   ; [0 1] [1 0]
                "XMA"  ; [0 2] [2 1] [2 2]
                "XMAS" 
                "MAS"
                "AS"
                "S"]
      vertical (map clojure.string/join (map-indexed (fn [i it] (map #(nth % i) in)) in))]
  )
#+end_src
